nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define HSCMP_RRCSR_RR_CH1OUT_MASK               (0x2U)
#define HSCMP_RRCSR_RR_CH1OUT_SHIFT              (1U)
/*! RR_CH1OUT - Comparison Result for Channel 1 */
#define HSCMP_RRCSR_RR_CH1OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH1OUT_SHIFT)) & HSCMP_RRCSR_RR_CH1OUT_MASK)

#define HSCMP_RRCSR_RR_CH2OUT_MASK               (0x4U)
#define HSCMP_RRCSR_RR_CH2OUT_SHIFT              (2U)
/*! RR_CH2OUT - Comparison Result for Channel 2 */
#define HSCMP_RRCSR_RR_CH2OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH2OUT_SHIFT)) & HSCMP_RRCSR_RR_CH2OUT_MASK)

#define HSCMP_RRCSR_RR_CH3OUT_MASK               (0x8U)
#define HSCMP_RRCSR_RR_CH3OUT_SHIFT              (3U)
/*! RR_CH3OUT - Comparison Result for Channel 3 */
#define HSCMP_RRCSR_RR_CH3OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH3OUT_SHIFT)) & HSCMP_RRCSR_RR_CH3OUT_MASK)

#define HSCMP_RRCSR_RR_CH4OUT_MASK               (0x10U)
#define HSCMP_RRCSR_RR_CH4OUT_SHIFT              (4U)
/*! RR_CH4OUT - Comparison Result for Channel 4 */
#define HSCMP_RRCSR_RR_CH4OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH4OUT_SHIFT)) & HSCMP_RRCSR_RR_CH4OUT_MASK)

#define HSCMP_RRCSR_RR_CH5OUT_MASK               (0x20U)
#define HSCMP_RRCSR_RR_CH5OUT_SHIFT              (5U)
/*! RR_CH5OUT - Comparison Result for Channel 5 */
#define HSCMP_RRCSR_RR_CH5OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH5OUT_SHIFT)) & HSCMP_RRCSR_RR_CH5OUT_MASK)

#define HSCMP_RRCSR_RR_CH6OUT_MASK               (0x40U)
#define HSCMP_RRCSR_RR_CH6OUT_SHIFT              (6U)
/*! RR_CH6OUT - Comparison Result for Channel 6 */
#define HSCMP_RRCSR_RR_CH6OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH6OUT_SHIFT)) & HSCMP_RRCSR_RR_CH6OUT_MASK)

#define HSCMP_RRCSR_RR_CH7OUT_MASK               (0x80U)
#define HSCMP_RRCSR_RR_CH7OUT_SHIFT              (7U)
/*! RR_CH7OUT - Comparison Result for Channel 7 */
#define HSCMP_RRCSR_RR_CH7OUT(x)                 (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCSR_RR_CH7OUT_SHIFT)) & HSCMP_RRCSR_RR_CH7OUT_MASK)
/*! @} */

/*! @name RRSR - Round Robin Status Register */
/*! @{ */

#define HSCMP_RRSR_RR_CH0F_MASK                  (0x1U)
#define HSCMP_RRSR_RR_CH0F_SHIFT                 (0U)
/*! RR_CH0F - Channel 0 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH0F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH0F_SHIFT)) & HSCMP_RRSR_RR_CH0F_MASK)

#define HSCMP_RRSR_RR_CH1F_MASK                  (0x2U)
#define HSCMP_RRSR_RR_CH1F_SHIFT                 (1U)
/*! RR_CH1F - Channel 1 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH1F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH1F_SHIFT)) & HSCMP_RRSR_RR_CH1F_MASK)

#define HSCMP_RRSR_RR_CH2F_MASK                  (0x4U)
#define HSCMP_RRSR_RR_CH2F_SHIFT                 (2U)
/*! RR_CH2F - Channel 2 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH2F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH2F_SHIFT)) & HSCMP_RRSR_RR_CH2F_MASK)

#define HSCMP_RRSR_RR_CH3F_MASK                  (0x8U)
#define HSCMP_RRSR_RR_CH3F_SHIFT                 (3U)
/*! RR_CH3F - Channel 3 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH3F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH3F_SHIFT)) & HSCMP_RRSR_RR_CH3F_MASK)

#define HSCMP_RRSR_RR_CH4F_MASK                  (0x10U)
#define HSCMP_RRSR_RR_CH4F_SHIFT                 (4U)
/*! RR_CH4F - Channel 4 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH4F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH4F_SHIFT)) & HSCMP_RRSR_RR_CH4F_MASK)

#define HSCMP_RRSR_RR_CH5F_MASK                  (0x20U)
#define HSCMP_RRSR_RR_CH5F_SHIFT                 (5U)
/*! RR_CH5F - Channel 5 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH5F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH5F_SHIFT)) & HSCMP_RRSR_RR_CH5F_MASK)

#define HSCMP_RRSR_RR_CH6F_MASK                  (0x40U)
#define HSCMP_RRSR_RR_CH6F_SHIFT                 (6U)
/*! RR_CH6F - Channel 6 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH6F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH6F_SHIFT)) & HSCMP_RRSR_RR_CH6F_MASK)

#define HSCMP_RRSR_RR_CH7F_MASK                  (0x80U)
#define HSCMP_RRSR_RR_CH7F_SHIFT                 (7U)
/*! RR_CH7F - Channel 7 Input Changed Flag
 *  0b0..Not different
 *  0b1..Different
 */
#define HSCMP_RRSR_RR_CH7F(x)                    (((uint32_t)(((uint32_t)(x)) << HSCMP_RRSR_RR_CH7F_SHIFT)) & HSCMP_RRSR_RR_CH7F_MASK)
/*! @} */

/*! @name RRCR2 - Round Robin Control Register 2 */
/*! @{ */

#define HSCMP_RRCR2_RR_TIMER_RELOAD_MASK         (0xFFFFFFFU)
#define HSCMP_RRCR2_RR_TIMER_RELOAD_SHIFT        (0U)
/*! RR_TIMER_RELOAD - Number of sample clocks */
#define HSCMP_RRCR2_RR_TIMER_RELOAD(x)           (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCR2_RR_TIMER_RELOAD_SHIFT)) & HSCMP_RRCR2_RR_TIMER_RELOAD_MASK)

#define HSCMP_RRCR2_RR_TIMER_EN_MASK             (0x80000000U)
#define HSCMP_RRCR2_RR_TIMER_EN_SHIFT            (31U)
/*! RR_TIMER_EN - Round-Robin internal timer enable.
 *  0b0..Round-Robin internal timer is disabled.
 *  0b1..Round-Robin internal timer is enabled.
 */
#define HSCMP_RRCR2_RR_TIMER_EN(x)               (((uint32_t)(((uint32_t)(x)) << HSCMP_RRCR2_RR_TIMER_EN_SHIFT)) & HSCMP_RRCR2_RR_TIMER_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group HSCMP_Register_Masks */


/* HSCMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSCMP0 base address */
  #define HSCMP0_BASE                              (0x500B3000u)
  /** Peripheral HSCMP0 base address */
  #define HSCMP0_BASE_NS                           (0x400B3000u)
  /** Peripheral HSCMP0 base pointer */
  #define HSCMP0                                   ((HSCMP_Type *)HSCMP0_BASE)
  /** Peripheral HSCMP0 base pointer */
  #define HSCMP0_NS                                ((HSCMP_Type *)HSCMP0_BASE_NS)
  /** Peripheral HSCMP1 base address */
  #define HSCMP1_BASE                              (0x500B7000u)
  /** Peripheral HSCMP1 base address */
  #define HSCMP1_BASE_NS                           (0x400B7000u)
  /** Peripheral HSCMP1 base pointer */
  #define HSCMP1                                   ((HSCMP_Type *)HSCMP1_BASE)
  /** Peripheral HSCMP1 base pointer */
  #define HSCMP1_NS                                ((HSCMP_Type *)HSCMP1_BASE_NS)
  /** Peripheral HSCMP2 base address */
  #define HSCMP2_BASE                              (0x500BA000u)
  /** Peripheral HSCMP2 base address */
  #define HSCMP2_BASE_NS                           (0x400BA000u)
  /** Peripheral HSCMP2 base pointer */
  #define HSCMP2                                   ((HSCMP_Type *)HSCMP2_BASE)
  /** Peripheral HSCMP2 base pointer */
  #define HSCMP2_NS                                ((HSCMP_Type *)HSCMP2_BASE_NS)
  /** Array initializer of HSCMP peripheral base addresses */
  #define HSCMP_BASE_ADDRS                         { HSCMP0_BASE, HSCMP1_BASE, HSCMP2_BASE }
  /** Array initializer of HSCMP peripheral base pointers */
  #define HSCMP_BASE_PTRS                          { HSCMP0, HSCMP1, HSCMP2 }
  /** Array initializer of HSCMP peripheral base addresses */
  #define HSCMP_BASE_ADDRS_NS                      { HSCMP0_BASE_NS, HSCMP1_BASE_NS, HSCMP2_BASE_NS }
  /** Array initializer of HSCMP peripheral base pointers */
  #define HSCMP_BASE_PTRS_NS                       { HSCMP0_NS, HSCMP1_NS, HSCMP2_NS }
#else
  /** Peripheral HSCMP0 base address */
  #define HSCMP0_BASE                              (0x400B3000u)
  /** Peripheral HSCMP0 base pointer */
  #define HSCMP0                                   ((HSCMP_Type *)HSCMP0_BASE)
  /** Peripheral HSCMP1 base address */
  #define HSCMP1_BASE                              (0x400B7000u)
  /** Peripheral HSCMP1 base pointer */
  #define HSCMP1                                   ((HSCMP_Type *)HSCMP1_BASE)
  /** Peripheral HSCMP2 base address */
  #define HSCMP2_BASE                              (0x400BA000u)
  /** Peripheral HSCMP2 base pointer */
  #define HSCMP2                                   ((HSCMP_Type *)HSCMP2_BASE)
  /** Array initializer of HSCMP peripheral base addresses */
  #define HSCMP_BASE_ADDRS                         { HSCMP0_BASE, HSCMP1_BASE, HSCMP2_BASE }
  /** Array initializer of HSCMP peripheral base pointers */
  #define HSCMP_BASE_PTRS                          { HSCMP0, HSCMP1, HSCMP2 }
#endif
/** Interrupt vectors for the HSCMP peripheral type */
#define HSCMP_IRQS                               { HSCMP0_IRQn, HSCMP1_IRQn, HSCMP2_IRQn }

/*!
 * @}
 */ /* end of group HSCMP_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- I2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 * @{
 */

/** I2C - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[2048];
  __IO uint32_t CFG;                               /**< Configuration Register, offset: 0x800 */
  __IO uint32_t STAT;                              /**< Status Register, offset: 0x804 */
  __IO uint32_t INTENSET;                          /**< Interrupt Enable Set Register, offset: 0x808 */
  __O  uint32_t INTENCLR;                          /**< Interrupt Enable Clear Register, offset: 0x80C */
  __IO uint32_t TIMEOUT;                           /**< Time-out Register, offset: 0x810 */
  __IO uint32_t CLKDIV;                            /**< Clock Divider Register, offset: 0x814 */
  __I  uint32_t INTSTAT;                           /**< Interrupt Status Register, offset: 0x818 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MSTCTL;                            /**< Master Control Register, offset: 0x820 */
  __IO uint32_t MSTTIME;                           /**< Master Timing Register, offset: 0x824 */
  __IO uint32_t MSTDAT;                            /**< Master Data Register, offset: 0x828 */
       uint8_t RESERVED_2[20];
  __IO uint32_t SLVCTL;                            /**< Slave Control Register, offset: 0x840 */
  __IO uint32_t SLVDAT;                            /**< Slave Data Register, offset: 0x844 */
  __IO uint32_t SLVADR[4];                         /**< Slave Address Register, array offset: 0x848, array step: 0x4 */
  __IO uint32_t SLVQUAL0;                          /**< Slave Qualification for Address 0 Register, offset: 0x858 */
       uint8_t RESERVED_3[36];
  __I  uint32_t MONRXDAT;                          /**< Monitor Receiver Data Register, offset: 0x880 */
       uint8_t RESERVED_4[1912];
  __I  uint32_t ID;                                /**< Peripheral Identification Register, offset: 0xFFC */
} I2C_Type;

/* ----------------------------------------------------------------------------
   -- I2C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I2C_Register_Masks I2C Register Masks
 * @{
 */

/*! @name CFG - Configuration Register */
/*! @{ */

#define I2C_CFG_MSTEN_MASK                       (0x1U)
#define I2C_CFG_MSTEN_SHIFT                      (0U)
/*! MSTEN - Master Enable
 *  0b0..Disabled. The I2C Master function is disabled. When disabled, the Master configuration settings are not
 *       changed, but the Master function is internally reset.
 *  0b1..Enabled. The I2C Master function is enabled.
 */
#define I2C_CFG_MSTEN(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_CFG_MSTEN_SHIFT)) & I2C_CFG_MSTEN_MASK)

