nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
/* The count of INPUTMUX_ADC1_TRIGN_ADC1_TRIG */
#define INPUTMUX_ADC1_TRIGN_ADC1_TRIG_COUNT      (4U)

/*! @name DAC0_TRIG - DAC0 Trigger Inputs */
/*! @{ */

#define INPUTMUX_DAC0_TRIG_TRIGIN_MASK           (0x1FU)
#define INPUTMUX_DAC0_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - DAC0 trigger input
 *  0b00000..PIN_INT0
 *  0b00001..PIN_INT3
 *  0b00010..SCT_OUT4
 *  0b00011..SCT_OUT5
 *  0b00100..SCT_OUT0
 *  0b00101..T0_MAT3
 *  0b00110..T1_MAT3
 *  0b00111..T2_MAT3
 *  0b01000..T2_MAT0
 *  0b01001..T3_MAT0
 *  0b01010..ACMP0_OUT
 *  0b01011..ARM_TXEV
 *  0b01100..GPIOINT_BMATCH
 *  0b01101..ADC0_tcomp[0]
 *  0b01110..ADC1_tcomp[0]
 *  0b01111..HSCMP0_OUT
 *  0b10000..HSCMP1_OUT
 *  0b10001..HSCMP2_OUT
 *  0b10010..AOI0_OUT0
 *  0b10011..AOI0_OUT1
 *  0b10100..AOI0_OUT2
 *  0b10101..AOI0_OUT3
 *  0b10110..AOI1_OUT0
 *  0b10111..AOI1_OUT1
 *  0b11000..AOI1_OUT2
 *  0b11001..AOI1_OUT3
 *  0b11010..DMA0_TRIGOUT0
 *  0b11011..DMA0_TRIGOUT1
 *  0b11100..DMA0_TRIGOUT2
 */
#define INPUTMUX_DAC0_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DAC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_DAC0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name DAC1_TRIG - DAC1 Trigger Inputs */
/*! @{ */

#define INPUTMUX_DAC1_TRIG_TRIGIN_MASK           (0x1FU)
#define INPUTMUX_DAC1_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - DAC1 trigger input
 *  0b00000..PIN_INT0
 *  0b00001..PIN_INT4
 *  0b00010..SCT_OUT4
 *  0b00011..SCT_OUT5
 *  0b00100..SCT_OUT1
 *  0b00101..T0_MAT3
 *  0b00110..T1_MAT3
 *  0b00111..T2_MAT3
 *  0b01000..T2_MAT1
 *  0b01001..T3_MAT1
 *  0b01010..ACMP0_OUT
 *  0b01011..ARM_TXEV
 *  0b01100..GPIOINT_BMATCH
 *  0b01101..ADC0_tcomp[1]
 *  0b01110..ADC1_tcomp[1]
 *  0b01111..HSCMP0_OUT
 *  0b10000..HSCMP1_OUT
 *  0b10001..HSCMP2_OUT
 *  0b10010..AOI0_OUT0
 *  0b10011..AOI0_OUT1
 *  0b10100..AOI0_OUT2
 *  0b10101..AOI0_OUT3
 *  0b10110..AOI1_OUT0
 *  0b10111..AOI1_OUT1
 *  0b11000..AOI1_OUT2
 *  0b11001..AOI1_OUT3
 *  0b11010..DMA0_TRIGOUT0
 *  0b11011..DMA0_TRIGOUT1
 *  0b11100..DMA0_TRIGOUT2
 */
#define INPUTMUX_DAC1_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DAC1_TRIG_TRIGIN_SHIFT)) & INPUTMUX_DAC1_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name DAC2_TRIG - DAC2 Trigger Inputs */
/*! @{ */

#define INPUTMUX_DAC2_TRIG_TRIGIN_MASK           (0x1FU)
#define INPUTMUX_DAC2_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - DAC2 trigger input
 *  0b00000..PIN_INT0
 *  0b00001..PIN_INT5
 *  0b00010..SCT_OUT4
 *  0b00011..SCT_OUT5
 *  0b00100..SCT_OUT2
 *  0b00101..T0_MAT3
 *  0b00110..T1_MAT3
 *  0b00111..T2_MAT3
 *  0b01000..T2_MAT2
 *  0b01001..T3_MAT2
 *  0b01010..ACMP0_OUT
 *  0b01011..ARM_TXEV
 *  0b01100..GPIOINT_BMATCH
 *  0b01101..ADC0_tcomp[2]
 *  0b01110..ADC1_tcomp[2]
 *  0b01111..HSCMP0_OUT
 *  0b10000..HSCMP1_OUT
 *  0b10001..HSCMP2_OUT
 *  0b10010..AOI0_OUT0
 *  0b10011..AOI0_OUT1
 *  0b10100..AOI0_OUT2
 *  0b10101..AOI0_OUT3
 *  0b10110..AOI1_OUT0
 *  0b10111..AOI1_OUT1
 *  0b11000..AOI1_OUT2
 *  0b11001..AOI1_OUT3
 *  0b11010..DMA0_TRIGOUT0
 *  0b11011..DMA0_TRIGOUT1
 *  0b11100..DMA0_TRIGOUT2
 */
#define INPUTMUX_DAC2_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DAC2_TRIG_TRIGIN_SHIFT)) & INPUTMUX_DAC2_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name ENC0_TRIG - ENC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_ENC0_TRIG_TRIGIN_MASK           (0x3FU)
#define INPUTMUX_ENC0_TRIG_TRIGIN_SHIFT          (0U)
/*! TRIGIN - ENC0 input trigger
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT4
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT1
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T1_MAT0
 *  0b001001..T3_MAT0
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM1_SM0_MUX_TRIG0
 *  0b011001..PWM1_SM0_MUX_TRIG1
 *  0b011010..PWM1_SM1_MUX_TRIG0
 *  0b011011..PWM1_SM1_MUX_TRIG1
 *  0b011100..PWM1_SM2_MUX_TRIG0
 *  0b011101..PWM1_SM2_MUX_TRIG1
 *  0b011110..PWM1_SM3_MUX_TRIG0
 *  0b011111..PWM1_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_ENC0_TRIG_TRIGIN(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ENC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ENC0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name ENC0_HOME - ENC0 Input Connections */
/*! @{ */

#define INPUTMUX_ENC0_HOME_ENC0_HOME_MASK        (0x3FU)
#define INPUTMUX_ENC0_HOME_ENC0_HOME_SHIFT       (0U)
/*! ENC0_HOME - ENC0 Input Connections
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT4
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT1
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T1_MAT0
 *  0b001001..T3_MAT0
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM1_SM0_MUX_TRIG0
 *  0b011001..PWM1_SM0_MUX_TRIG1
 *  0b011010..PWM1_SM0_MUX_TRIG0
 *  0b011011..PWM1_SM1_MUX_TRIG1
 *  0b011100..PWM1_SM2_MUX_TRIG0
 *  0b011101..PWM1_SM2_MUX_TRIG1
 *  0b011110..PWM1_SM3_MUX_TRIG0
 *  0b011111..PWM1_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_ENC0_HOME_ENC0_HOME(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ENC0_HOME_ENC0_HOME_SHIFT)) & INPUTMUX_ENC0_HOME_ENC0_HOME_MASK)
/*! @} */

/*! @name ENC0_INDEX - ENC0 Input Connections */
/*! @{ */

#define INPUTMUX_ENC0_INDEX_ENC0_INDEX_MASK      (0x3FU)
#define INPUTMUX_ENC0_INDEX_ENC0_INDEX_SHIFT     (0U)
/*! ENC0_INDEX - ENC0 Input Connections
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT4
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT1
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T1_MAT0
 *  0b001001..T3_MAT0
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM1_SM0_MUX_TRIG0
 *  0b011001..PWM1_SM0_MUX_TRIG1
 *  0b011010..PWM1_SM1_MUX_TRIG0
 *  0b011011..PWM1_SM1_MUX_TRIG1
 *  0b011100..PWM1_SM2_MUX_TRIG0
 *  0b011101..PWM1_SM2_MUX_TRIG1
 *  0b011110..PWM1_SM3_MUX_TRIG0
 *  0b011111..PWM1_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_ENC0_INDEX_ENC0_INDEX(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ENC0_INDEX_ENC0_INDEX_SHIFT)) & INPUTMUX_ENC0_INDEX_ENC0_INDEX_MASK)
/*! @} */

