nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA8_MASK   (0x100U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA8_SHIFT  (8U)
/*! REQ_ENA8 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA8(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA8_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA8_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA9_MASK   (0x200U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA9_SHIFT  (9U)
/*! REQ_ENA9 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA9(x)     (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA9_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA9_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA10_MASK  (0x400U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA10_SHIFT (10U)
/*! REQ_ENA10 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA10(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA10_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA10_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA11_MASK  (0x800U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA11_SHIFT (11U)
/*! REQ_ENA11 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA11(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA11_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA11_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA12_MASK  (0x1000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA12_SHIFT (12U)
/*! REQ_ENA12 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA12(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA12_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA12_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA13_MASK  (0x2000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA13_SHIFT (13U)
/*! REQ_ENA13 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA13(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA13_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA13_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA14_MASK  (0x4000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA14_SHIFT (14U)
/*! REQ_ENA14 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA14(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA14_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA14_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA15_MASK  (0x8000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA15_SHIFT (15U)
/*! REQ_ENA15 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA15(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA15_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA15_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA16_MASK  (0x10000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA16_SHIFT (16U)
/*! REQ_ENA16 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA16(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA16_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA16_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA17_MASK  (0x20000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA17_SHIFT (17U)
/*! REQ_ENA17 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA17(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA17_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA17_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA18_MASK  (0x40000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA18_SHIFT (18U)
/*! REQ_ENA18 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA18(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA18_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA18_MASK)

#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA19_MASK  (0x80000U)
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA19_SHIFT (19U)
/*! REQ_ENA19 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN1 register. */
#define INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA19(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA19_SHIFT)) & INPUTMUX_DMA0_REQEN1_CLR_REQ_ENA19_MASK)
/*! @} */

/*! @name DMA1_REQEN - Enable DMA1 requests */
/*! @{ */

#define INPUTMUX_DMA1_REQEN_REQ_ENA0_MASK        (0x1U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA0_SHIFT       (0U)
/*! REQ_ENA0 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA0(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA0_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA0_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA1_MASK        (0x2U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA1_SHIFT       (1U)
/*! REQ_ENA1 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA1(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA1_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA1_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA2_MASK        (0x4U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA2_SHIFT       (2U)
/*! REQ_ENA2 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA2(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA2_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA2_MASK)

