nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define INPUTMUX_DMA1_REQEN_REQ_ENA3_MASK        (0x8U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA3_SHIFT       (3U)
/*! REQ_ENA3 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA3(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA3_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA3_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA4_MASK        (0x10U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA4_SHIFT       (4U)
/*! REQ_ENA4 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA4(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA4_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA4_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA5_MASK        (0x20U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA5_SHIFT       (5U)
/*! REQ_ENA5 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA5(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA5_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA5_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA6_MASK        (0x40U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA6_SHIFT       (6U)
/*! REQ_ENA6 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA6(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA6_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA6_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA7_MASK        (0x80U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA7_SHIFT       (7U)
/*! REQ_ENA7 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA7(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA7_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA7_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA8_MASK        (0x100U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA8_SHIFT       (8U)
/*! REQ_ENA8 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA8(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA8_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA8_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA9_MASK        (0x200U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA9_SHIFT       (9U)
/*! REQ_ENA9 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA9(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA9_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA9_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA10_MASK       (0x400U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA10_SHIFT      (10U)
/*! REQ_ENA10 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA10(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA10_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA10_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA11_MASK       (0x800U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA11_SHIFT      (11U)
/*! REQ_ENA11 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA11(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA11_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA11_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA12_MASK       (0x1000U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA12_SHIFT      (12U)
/*! REQ_ENA12 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA12(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA12_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA12_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA13_MASK       (0x2000U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA13_SHIFT      (13U)
/*! REQ_ENA13 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA13(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA13_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA13_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA14_MASK       (0x4000U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA14_SHIFT      (14U)
/*! REQ_ENA14 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA14(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA14_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA14_MASK)

#define INPUTMUX_DMA1_REQEN_REQ_ENA15_MASK       (0x8000U)
#define INPUTMUX_DMA1_REQEN_REQ_ENA15_SHIFT      (15U)
/*! REQ_ENA15 - Controls the 16 request inputs of DMA1. If bit i is '1' the DMA request input #i is enabled. */
#define INPUTMUX_DMA1_REQEN_REQ_ENA15(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_REQ_ENA15_SHIFT)) & INPUTMUX_DMA1_REQEN_REQ_ENA15_MASK)
/*! @} */

/*! @name DMA1_REQEN_SET - Set bits in DMA1_REQEN register */
/*! @{ */

#define INPUTMUX_DMA1_REQEN_SET_SET0_MASK        (0x1U)
#define INPUTMUX_DMA1_REQEN_SET_SET0_SHIFT       (0U)
/*! SET0 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET0(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET0_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET0_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET1_MASK        (0x2U)
#define INPUTMUX_DMA1_REQEN_SET_SET1_SHIFT       (1U)
/*! SET1 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET1(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET1_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET1_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET2_MASK        (0x4U)
#define INPUTMUX_DMA1_REQEN_SET_SET2_SHIFT       (2U)
/*! SET2 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET2(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET2_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET2_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET3_MASK        (0x8U)
#define INPUTMUX_DMA1_REQEN_SET_SET3_SHIFT       (3U)
/*! SET3 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET3(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET3_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET3_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET4_MASK        (0x10U)
#define INPUTMUX_DMA1_REQEN_SET_SET4_SHIFT       (4U)
/*! SET4 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET4(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET4_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET4_MASK)

#define INPUTMUX_DMA1_REQEN_SET_SET5_MASK        (0x20U)
#define INPUTMUX_DMA1_REQEN_SET_SET5_SHIFT       (5U)
/*! SET5 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is set to 1; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_SET_SET5(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_SET_SET5_SHIFT)) & INPUTMUX_DMA1_REQEN_SET_SET5_MASK)

