nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define INPUTMUX_DMA1_REQEN_CLR_CLR10_MASK       (0x400U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR10_SHIFT      (10U)
/*! CLR10 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR10(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR10_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR10_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR11_MASK       (0x800U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR11_SHIFT      (11U)
/*! CLR11 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR11(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR11_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR11_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR12_MASK       (0x1000U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR12_SHIFT      (12U)
/*! CLR12 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR12(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR12_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR12_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR13_MASK       (0x2000U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR13_SHIFT      (13U)
/*! CLR13 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR13(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR13_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR13_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR14_MASK       (0x4000U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR14_SHIFT      (14U)
/*! CLR14 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR14(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR14_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR14_MASK)

#define INPUTMUX_DMA1_REQEN_CLR_CLR15_MASK       (0x8000U)
#define INPUTMUX_DMA1_REQEN_CLR_CLR15_SHIFT      (15U)
/*! CLR15 - Write : If bit #i = 1, bit #i in DMA1_REQEN register is reset to 0; if bit #i = 0 , no change in DMA1_REQEN register */
#define INPUTMUX_DMA1_REQEN_CLR_CLR15(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA1_REQEN_CLR_CLR15_SHIFT)) & INPUTMUX_DMA1_REQEN_CLR_CLR15_MASK)
/*! @} */

/*! @name DMA0_ITRIGEN0 - Enable DMA0 triggers */
/*! @{ */

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN0_MASK     (0x1U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN0_SHIFT    (0U)
/*! ITRIGEN0 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN0(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN0_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN0_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN1_MASK     (0x2U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN1_SHIFT    (1U)
/*! ITRIGEN1 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN1(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN1_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN1_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN2_MASK     (0x4U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN2_SHIFT    (2U)
/*! ITRIGEN2 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN2(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN2_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN2_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN3_MASK     (0x8U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN3_SHIFT    (3U)
/*! ITRIGEN3 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN3(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN3_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN3_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN4_MASK     (0x10U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN4_SHIFT    (4U)
/*! ITRIGEN4 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN4(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN4_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN4_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN5_MASK     (0x20U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN5_SHIFT    (5U)
/*! ITRIGEN5 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN5(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN5_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN5_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN6_MASK     (0x40U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN6_SHIFT    (6U)
/*! ITRIGEN6 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN6(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN6_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN6_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN7_MASK     (0x80U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN7_SHIFT    (7U)
/*! ITRIGEN7 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN7(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN7_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN7_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN8_MASK     (0x100U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN8_SHIFT    (8U)
/*! ITRIGEN8 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN8(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN8_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN8_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN9_MASK     (0x200U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN9_SHIFT    (9U)
/*! ITRIGEN9 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN9(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN9_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN9_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN10_MASK    (0x400U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN10_SHIFT   (10U)
/*! ITRIGEN10 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN10(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN10_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN10_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN11_MASK    (0x800U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN11_SHIFT   (11U)
/*! ITRIGEN11 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN11(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN11_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN11_MASK)

