nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN12_MASK    (0x1000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN12_SHIFT   (12U)
/*! ITRIGEN12 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN12(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN12_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN12_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN13_MASK    (0x2000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN13_SHIFT   (13U)
/*! ITRIGEN13 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN13(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN13_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN13_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN14_MASK    (0x4000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN14_SHIFT   (14U)
/*! ITRIGEN14 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN14(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN14_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN14_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN15_MASK    (0x8000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN15_SHIFT   (15U)
/*! ITRIGEN15 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN15(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN15_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN15_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN16_MASK    (0x10000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN16_SHIFT   (16U)
/*! ITRIGEN16 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN16(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN16_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN16_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN17_MASK    (0x20000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN17_SHIFT   (17U)
/*! ITRIGEN17 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN17(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN17_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN17_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN18_MASK    (0x40000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN18_SHIFT   (18U)
/*! ITRIGEN18 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN18(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN18_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN18_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN19_MASK    (0x80000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN19_SHIFT   (19U)
/*! ITRIGEN19 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN19(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN19_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN19_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN20_MASK    (0x100000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN20_SHIFT   (20U)
/*! ITRIGEN20 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN20(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN20_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN20_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN21_MASK    (0x200000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN21_SHIFT   (21U)
/*! ITRIGEN21 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN21(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN21_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN21_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN22_MASK    (0x400000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN22_SHIFT   (22U)
/*! ITRIGEN22 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN22(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN22_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN22_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN23_MASK    (0x800000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN23_SHIFT   (23U)
/*! ITRIGEN23 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN23(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN23_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN23_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN24_MASK    (0x1000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN24_SHIFT   (24U)
/*! ITRIGEN24 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN24(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN24_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN24_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN25_MASK    (0x2000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN25_SHIFT   (25U)
/*! ITRIGEN25 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN25(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN25_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN25_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN26_MASK    (0x4000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN26_SHIFT   (26U)
/*! ITRIGEN26 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN26(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN26_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN26_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN27_MASK    (0x8000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN27_SHIFT   (27U)
/*! ITRIGEN27 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN27(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN27_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN27_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN28_MASK    (0x10000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN28_SHIFT   (28U)
/*! ITRIGEN28 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN28(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN28_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN28_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN29_MASK    (0x20000000U)
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN29_SHIFT   (29U)
/*! ITRIGEN29 - Controls the 32 trigger inputs of DMA0. If bit i is '1' the DMA trigger input #i is enabled. */
#define INPUTMUX_DMA0_ITRIGEN0_ITRIGEN29(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_ITRIGEN29_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_ITRIGEN29_MASK)

