nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define PMC_CMD_DCDCDISABLE_MASK                 (0x2U)
#define PMC_CMD_DCDCDISABLE_SHIFT                (1U)
/*! DCDCDISABLE - Disable DCDC (self clearing bit).
 *  0b0..No effect.
 *  0b1..Disbale DCDC. Automatically reset to '0' by the Hardware.
 */
#define PMC_CMD_DCDCDISABLE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_CMD_DCDCDISABLE_SHIFT)) & PMC_CMD_DCDCDISABLE_MASK)

#define PMC_CMD_LDOCOREHIGHPWRENABLE_MASK        (0x4U)
#define PMC_CMD_LDOCOREHIGHPWRENABLE_SHIFT       (2U)
/*! LDOCOREHIGHPWRENABLE - Enable LDO CORE High Power Mode (self clearing bit).
 *  0b0..No effect.
 *  0b1..Enable LDO CORE High Power Mode. Automatically reset to '0' by the Hardware.
 */
#define PMC_CMD_LDOCOREHIGHPWRENABLE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_CMD_LDOCOREHIGHPWRENABLE_SHIFT)) & PMC_CMD_LDOCOREHIGHPWRENABLE_MASK)

#define PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK       (0x8U)
#define PMC_CMD_LDOCOREHIGHPWRDISABLE_SHIFT      (3U)
/*! LDOCOREHIGHPWRDISABLE - Disable LDO CORE High Power Mode (self clearing bit).
 *  0b0..No effect.
 *  0b1..Disable LDO CORE High Power Mode. Automatically reset to '0' by the Hardware.
 */
#define PMC_CMD_LDOCOREHIGHPWRDISABLE(x)         (((uint32_t)(((uint32_t)(x)) << PMC_CMD_LDOCOREHIGHPWRDISABLE_SHIFT)) & PMC_CMD_LDOCOREHIGHPWRDISABLE_MASK)

#define PMC_CMD_LDOCORELOWPWRENABLE_MASK         (0x10U)
#define PMC_CMD_LDOCORELOWPWRENABLE_SHIFT        (4U)
/*! LDOCORELOWPWRENABLE - Enable LDO CORE Low Power Mode (self clearing bit).
 *  0b0..No effect.
 *  0b1..Enable LDO CORE Low Power Mode. Automatically reset to '0' by the Hardware.
 */
#define PMC_CMD_LDOCORELOWPWRENABLE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_CMD_LDOCORELOWPWRENABLE_SHIFT)) & PMC_CMD_LDOCORELOWPWRENABLE_MASK)

#define PMC_CMD_LDOCORELOWPWRDISABLE_MASK        (0x20U)
#define PMC_CMD_LDOCORELOWPWRDISABLE_SHIFT       (5U)
/*! LDOCORELOWPWRDISABLE - Disable LDO CORE Low Power Mode (self clearing bit).
 *  0b0..No effect.
 *  0b1..Disable LDO CORE Low Power Mode. Automatically reset to '0' by the Hardware.
 */
#define PMC_CMD_LDOCORELOWPWRDISABLE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_CMD_LDOCORELOWPWRDISABLE_SHIFT)) & PMC_CMD_LDOCORELOWPWRDISABLE_MASK)
/*! @} */

/*! @name WAKEUPIOCTRL - Wake-up IO control */
/*! @{ */

#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP0_MASK  (0x1U)
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP0_SHIFT (0U)
/*! RISINGEDGEWAKEUP0 - Enable / disable detection of rising edge events on Wake Up 0 pin in Deep Power Down modes:.
 *  0b0..Rising edge detection is disabled.
 *  0b1..Rising edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP0(x)    (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP0_SHIFT)) & PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP0_MASK)

#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP0_MASK (0x2U)
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP0_SHIFT (1U)
/*! FALLINGEDGEWAKEUP0 - Enable / disable detection of falling edge events on Wake Up 0 pin in Deep Power Down modes:.
 *  0b0..Falling edge detection is disabled.
 *  0b1..Falling edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP0(x)   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP0_SHIFT)) & PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP0_MASK)

#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP1_MASK  (0x4U)
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP1_SHIFT (2U)
/*! RISINGEDGEWAKEUP1 - Enable / disable detection of rising edge events on Wake Up 1 pin in Deep Power Down modes:.
 *  0b0..Rising edge detection is disabled.
 *  0b1..Rising edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP1(x)    (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP1_SHIFT)) & PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP1_MASK)

#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP1_MASK (0x8U)
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP1_SHIFT (3U)
/*! FALLINGEDGEWAKEUP1 - Enable / disable detection of falling edge events on Wake Up 1 pin in Deep Power Down modes:.
 *  0b0..Falling edge detection is disabled.
 *  0b1..Falling edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP1(x)   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP1_SHIFT)) & PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP1_MASK)

#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP2_MASK  (0x10U)
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP2_SHIFT (4U)
/*! RISINGEDGEWAKEUP2 - Enable / disable detection of rising edge events on Wake Up 2 pin in Deep Power Down modes:.
 *  0b0..Rising edge detection is disabled.
 *  0b1..Rising edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP2(x)    (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP2_SHIFT)) & PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP2_MASK)

#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP2_MASK (0x20U)
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP2_SHIFT (5U)
/*! FALLINGEDGEWAKEUP2 - Enable / disable detection of falling edge events on Wake Up 2 pin in Deep Power Down modes:.
 *  0b0..Falling edge detection is disabled.
 *  0b1..Falling edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP2(x)   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP2_SHIFT)) & PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP2_MASK)

#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP3_MASK  (0x40U)
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP3_SHIFT (6U)
/*! RISINGEDGEWAKEUP3 - Enable / disable detection of rising edge events on Wake Up 3 pin in Deep Power Down modes:
 *  0b0..Rising edge detection is disabled.
 *  0b1..Rising edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP3(x)    (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP3_SHIFT)) & PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP3_MASK)

#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP3_MASK (0x80U)
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP3_SHIFT (7U)
/*! FALLINGEDGEWAKEUP3 - Enable / disable detection of falling edge events on Wake Up 3 pin in Deep Power Down modes:
 *  0b0..Falling edge detection is disabled.
 *  0b1..Falling edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP3(x)   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP3_SHIFT)) & PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP3_MASK)

#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP4_MASK  (0x100U)
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP4_SHIFT (8U)
/*! RISINGEDGEWAKEUP4 - Enable / disable detection of rising edge events on Wake Up 4 pin in Deep Power Down modes:
 *  0b0..Rising edge detection is disabled.
 *  0b1..Rising edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP4(x)    (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP4_SHIFT)) & PMC_WAKEUPIOCTRL_RISINGEDGEWAKEUP4_MASK)

#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP4_MASK (0x200U)
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP4_SHIFT (9U)
/*! FALLINGEDGEWAKEUP4 - Enable / disable detection of falling edge events on Wake Up 4 pin in Deep Power Down modes:
 *  0b0..Falling edge detection is disabled.
 *  0b1..Falling edge detection is enabled.
 */
#define PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP4(x)   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP4_SHIFT)) & PMC_WAKEUPIOCTRL_FALLINGEDGEWAKEUP4_MASK)

#define PMC_WAKEUPIOCTRL_MODEWAKEUPIOPAD0_MASK   (0xC00U)
#define PMC_WAKEUPIOCTRL_MODEWAKEUPIOPAD0_SHIFT  (10U)
/*! MODEWAKEUPIOPAD0 - Selects function mode (on-chip pull-up/pull-down resistor control).
 *  0b00..Inactive. Inactive (no pull-down/pull-up resistor enabled).
 *  0b01..Pull-down. Pull-down resistor enabled.
 *  0b10..Pull-up. Pull-up resistor enabled.
 *  0b11..Repeater. Repeater mode.
 */
#define PMC_WAKEUPIOCTRL_MODEWAKEUPIOPAD0(x)     (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_MODEWAKEUPIOPAD0_SHIFT)) & PMC_WAKEUPIOCTRL_MODEWAKEUPIOPAD0_MASK)

