nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
/*! @name RTCOSC32K - 32 KHz clocks source control */
/*! @{ */

#define PMC_RTCOSC32K_SEL_MASK                   (0x1U)
#define PMC_RTCOSC32K_SEL_SHIFT                  (0U)
/*! SEL - Select the 32K oscillator to be used in for the RTC, the OS Event Timer and the rest of
 *    the SoC (either XTAL32KHz or FRO32KHz) .
 *  0b0..FRO 32 KHz.
 *  0b1..XTAL 32KHz.
 */
#define PMC_RTCOSC32K_SEL(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_RTCOSC32K_SEL_SHIFT)) & PMC_RTCOSC32K_SEL_MASK)
/*! @} */

/*! @name OSEVENTTIMER - OS Event Timer control */
/*! @{ */

#define PMC_OSEVENTTIMER_SOFTRESET_MASK          (0x1U)
#define PMC_OSEVENTTIMER_SOFTRESET_SHIFT         (0U)
/*! SOFTRESET - Active high reset. */
#define PMC_OSEVENTTIMER_SOFTRESET(x)            (((uint32_t)(((uint32_t)(x)) << PMC_OSEVENTTIMER_SOFTRESET_SHIFT)) & PMC_OSEVENTTIMER_SOFTRESET_MASK)

#define PMC_OSEVENTTIMER_CLOCKENABLE_MASK        (0x2U)
#define PMC_OSEVENTTIMER_CLOCKENABLE_SHIFT       (1U)
/*! CLOCKENABLE - Enable OSTIMER 32 KHz clock. */
#define PMC_OSEVENTTIMER_CLOCKENABLE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_OSEVENTTIMER_CLOCKENABLE_SHIFT)) & PMC_OSEVENTTIMER_CLOCKENABLE_MASK)

#define PMC_OSEVENTTIMER_DPDWAKEUPENABLE_MASK    (0x4U)
#define PMC_OSEVENTTIMER_DPDWAKEUPENABLE_SHIFT   (2U)
/*! DPDWAKEUPENABLE - Wake up enable in Deep Power Down mode (To be used in Enable Deep Power Down mode). */
#define PMC_OSEVENTTIMER_DPDWAKEUPENABLE(x)      (((uint32_t)(((uint32_t)(x)) << PMC_OSEVENTTIMER_DPDWAKEUPENABLE_SHIFT)) & PMC_OSEVENTTIMER_DPDWAKEUPENABLE_MASK)

#define PMC_OSEVENTTIMER_SELCLOCK_MASK           (0x18U)
#define PMC_OSEVENTTIMER_SELCLOCK_SHIFT          (3U)
/*! SELCLOCK - Select OS Event Timer Clock source
 *  0b00..32-KHz Free Running Oscillator (FRO)
 *  0b01..32-KHz Crystal Oscillator (XTAL)
 *  0b10..1-MHz FRO
 *  0b11..System Bus clock
 */
#define PMC_OSEVENTTIMER_SELCLOCK(x)             (((uint32_t)(((uint32_t)(x)) << PMC_OSEVENTTIMER_SELCLOCK_SHIFT)) & PMC_OSEVENTTIMER_SELCLOCK_MASK)
/*! @} */

/*! @name PDSLEEPCFG1 - Power down sleep configuration 1 */
/*! @{ */

#define PMC_PDSLEEPCFG1_PDEN_CMPBIAS_MASK        (0x1U)
#define PMC_PDSLEEPCFG1_PDEN_CMPBIAS_SHIFT       (0U)
/*! PDEN_CMPBIAS - Controls Comparators 1/2/3 Bias power during DEEP-SLEEP (always shut down during POWER-DOWN & DEEP-POWER-DOWN).
 *  0b0..Analog Bias is powered on during low power mode.
 *  0b1..Analog Bias is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_CMPBIAS(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_CMPBIAS_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_CMPBIAS_MASK)

#define PMC_PDSLEEPCFG1_PDEN_HSCMP0_DAC_MASK     (0x2U)
#define PMC_PDSLEEPCFG1_PDEN_HSCMP0_DAC_SHIFT    (1U)
/*! PDEN_HSCMP0_DAC - Controls High Speed Comparator0 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN & DEEP-POWER-DOWN).
 *  0b0..High Speed Comparator0 DAC is powered on during low power mode.
 *  0b1..High Speed Comparator0 DAC is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_HSCMP0_DAC(x)       (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_HSCMP0_DAC_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_HSCMP0_DAC_MASK)

#define PMC_PDSLEEPCFG1_PDEN_HSCMP1_DAC_MASK     (0x4U)
#define PMC_PDSLEEPCFG1_PDEN_HSCMP1_DAC_SHIFT    (2U)
/*! PDEN_HSCMP1_DAC - Controls High Speed Comparator1 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN & DEEP-POWER-DOWN).
 *  0b0..High Speed Comparator1 DAC is powered on during low power mode.
 *  0b1..High Speed Comparator1 DAC is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_HSCMP1_DAC(x)       (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_HSCMP1_DAC_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_HSCMP1_DAC_MASK)

#define PMC_PDSLEEPCFG1_PDEN_HSCMP2_DAC_MASK     (0x8U)
#define PMC_PDSLEEPCFG1_PDEN_HSCMP2_DAC_SHIFT    (3U)
/*! PDEN_HSCMP2_DAC - Controls High Speed Comparator2 DAC power during DEEP-SLEEP (always shut down during POWER-DOWN & DEEP-POWER-DOWN).
 *  0b0..High Speed Comparator2 DAC is powered on during low power mode.
 *  0b1..High Speed Comparator2 DAC is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_HSCMP2_DAC(x)       (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_HSCMP2_DAC_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_HSCMP2_DAC_MASK)

#define PMC_PDSLEEPCFG1_PDEN_DAC0_MASK           (0x10U)
#define PMC_PDSLEEPCFG1_PDEN_DAC0_SHIFT          (4U)
/*! PDEN_DAC0 - Controls DAC0 power during DEEP-SLEEP & POWER-DOWN (always shut down during DEEP-POWER-DOWN).
 *  0b0..DAC0 is powered on during low power mode.
 *  0b1..DAC0 is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_DAC0(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_DAC0_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_DAC0_MASK)

#define PMC_PDSLEEPCFG1_PDEN_DAC1_MASK           (0x20U)
#define PMC_PDSLEEPCFG1_PDEN_DAC1_SHIFT          (5U)
/*! PDEN_DAC1 - Controls DAC1 power during DEEP-SLEEP & POWER-DOWN (always shut down during DEEP-POWER-DOWN).
 *  0b0..DAC1 is powered on during low power mode.
 *  0b1..DAC1 is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_DAC1(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_DAC1_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_DAC1_MASK)

#define PMC_PDSLEEPCFG1_PDEN_DAC2_MASK           (0x40U)
#define PMC_PDSLEEPCFG1_PDEN_DAC2_SHIFT          (6U)
/*! PDEN_DAC2 - Controls DAC2 power during DEEP-SLEEP & POWER-DOWN (always shut down during DEEP-POWER-DOWN).
 *  0b0..DAC2 is powered on during low power mode.
 *  0b1..DAC2 is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG1_PDEN_DAC2(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PDEN_DAC2_SHIFT)) & PMC_PDSLEEPCFG1_PDEN_DAC2_MASK)

#define PMC_PDSLEEPCFG1_STOPEN_DAC0_MASK         (0x80U)
#define PMC_PDSLEEPCFG1_STOPEN_DAC0_SHIFT        (7U)
/*! STOPEN_DAC0 - Controls DAC0 Stop mode during DEEP-SLEEP & POWER-DOWN (DAC stop mode is always disabled in DEEP-POWER-DOWN).
 *  0b0..DAC Stop Mode is disabled.
 *  0b1..DAC Stop Mode is enabled.
 */
#define PMC_PDSLEEPCFG1_STOPEN_DAC0(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_STOPEN_DAC0_SHIFT)) & PMC_PDSLEEPCFG1_STOPEN_DAC0_MASK)

