nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define PMC_SRAMCTRL0_RAM_30_DSB_MASK            (0x20000000U)
#define PMC_SRAMCTRL0_RAM_30_DSB_SHIFT           (29U)
/*! RAM_30_DSB - RAM_30 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAM_30_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_30_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_30_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_30_DSBDEL_MASK         (0x40000000U)
#define PMC_SRAMCTRL0_RAM_30_DSBDEL_SHIFT        (30U)
/*! RAM_30_DSBDEL - RAM_30 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAM_30_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_30_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_30_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_30_LSDEL_MASK          (0x80000000U)
#define PMC_SRAMCTRL0_RAM_30_LSDEL_SHIFT         (31U)
/*! RAM_30_LSDEL - RAM_30 Light Sleep mode delayed. */
#define PMC_SRAMCTRL0_RAM_30_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_30_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_30_LSDEL_MASK)
/*! @} */

/*! @name SRAMCTRL1 - SRAM control 1 */
/*! @{ */

#define PMC_SRAMCTRL1_RAM_40_LS_MASK             (0x1U)
#define PMC_SRAMCTRL1_RAM_40_LS_SHIFT            (0U)
/*! RAM_40_LS - RAM_40 Light Sleep mode. */
#define PMC_SRAMCTRL1_RAM_40_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_40_LS_SHIFT)) & PMC_SRAMCTRL1_RAM_40_LS_MASK)

#define PMC_SRAMCTRL1_RAM_40_DSB_MASK            (0x2U)
#define PMC_SRAMCTRL1_RAM_40_DSB_SHIFT           (1U)
/*! RAM_40_DSB - RAM_40 Deep sleep mode. */
#define PMC_SRAMCTRL1_RAM_40_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_40_DSB_SHIFT)) & PMC_SRAMCTRL1_RAM_40_DSB_MASK)

#define PMC_SRAMCTRL1_RAM_40_DSBDEL_MASK         (0x4U)
#define PMC_SRAMCTRL1_RAM_40_DSBDEL_SHIFT        (2U)
/*! RAM_40_DSBDEL - RAM_40 Deep sleep delayed. */
#define PMC_SRAMCTRL1_RAM_40_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_40_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_40_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAM_40_LSDEL_MASK          (0x8U)
#define PMC_SRAMCTRL1_RAM_40_LSDEL_SHIFT         (3U)
/*! RAM_40_LSDEL - RAM_40 Sleep mode disable. */
#define PMC_SRAMCTRL1_RAM_40_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_40_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_40_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAM_41_LS_MASK             (0x10U)
#define PMC_SRAMCTRL1_RAM_41_LS_SHIFT            (4U)
/*! RAM_41_LS - RAM_41 Light Sleep mode. */
#define PMC_SRAMCTRL1_RAM_41_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_41_LS_SHIFT)) & PMC_SRAMCTRL1_RAM_41_LS_MASK)

#define PMC_SRAMCTRL1_RAM_41_DSB_MASK            (0x20U)
#define PMC_SRAMCTRL1_RAM_41_DSB_SHIFT           (5U)
/*! RAM_41_DSB - RAM_41 Deep sleep mode. */
#define PMC_SRAMCTRL1_RAM_41_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_41_DSB_SHIFT)) & PMC_SRAMCTRL1_RAM_41_DSB_MASK)

#define PMC_SRAMCTRL1_RAM_41_DSBDEL_MASK         (0x40U)
#define PMC_SRAMCTRL1_RAM_41_DSBDEL_SHIFT        (6U)
/*! RAM_41_DSBDEL - RAM_41 Deep sleep delayed. */
#define PMC_SRAMCTRL1_RAM_41_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_41_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_41_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAM_41_LSDEL_MASK          (0x80U)
#define PMC_SRAMCTRL1_RAM_41_LSDEL_SHIFT         (7U)
/*! RAM_41_LSDEL - RAM_41 Sleep mode disable. */
#define PMC_SRAMCTRL1_RAM_41_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_41_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_41_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAM_42_LS_MASK             (0x100U)
#define PMC_SRAMCTRL1_RAM_42_LS_SHIFT            (8U)
/*! RAM_42_LS - RAM_42 Light Sleep mode. */
#define PMC_SRAMCTRL1_RAM_42_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_42_LS_SHIFT)) & PMC_SRAMCTRL1_RAM_42_LS_MASK)

#define PMC_SRAMCTRL1_RAM_42_DSB_MASK            (0x200U)
#define PMC_SRAMCTRL1_RAM_42_DSB_SHIFT           (9U)
/*! RAM_42_DSB - RAM_42 Deep sleep mode. */
#define PMC_SRAMCTRL1_RAM_42_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_42_DSB_SHIFT)) & PMC_SRAMCTRL1_RAM_42_DSB_MASK)

#define PMC_SRAMCTRL1_RAM_42_DSBDEL_MASK         (0x400U)
#define PMC_SRAMCTRL1_RAM_42_DSBDEL_SHIFT        (10U)
/*! RAM_42_DSBDEL - RAM_42 Deep sleep delayed. */
#define PMC_SRAMCTRL1_RAM_42_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_42_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_42_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAM_42_LSDEL_MASK          (0x800U)
#define PMC_SRAMCTRL1_RAM_42_LSDEL_SHIFT         (11U)
/*! RAM_42_LSDEL - RAM_42 Sleep mode disable. */
#define PMC_SRAMCTRL1_RAM_42_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_42_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_42_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAM_43_LS_MASK             (0x1000U)
#define PMC_SRAMCTRL1_RAM_43_LS_SHIFT            (12U)
/*! RAM_43_LS - RAM_43 Light Sleep mode. */
#define PMC_SRAMCTRL1_RAM_43_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_43_LS_SHIFT)) & PMC_SRAMCTRL1_RAM_43_LS_MASK)

#define PMC_SRAMCTRL1_RAM_43_DSB_MASK            (0x2000U)
#define PMC_SRAMCTRL1_RAM_43_DSB_SHIFT           (13U)
/*! RAM_43_DSB - RAM_43 Deep sleep mode. */
#define PMC_SRAMCTRL1_RAM_43_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_43_DSB_SHIFT)) & PMC_SRAMCTRL1_RAM_43_DSB_MASK)

#define PMC_SRAMCTRL1_RAM_43_DSBDEL_MASK         (0x4000U)
#define PMC_SRAMCTRL1_RAM_43_DSBDEL_SHIFT        (14U)
/*! RAM_43_DSBDEL - RAM_43 Deep sleep delayed. */
#define PMC_SRAMCTRL1_RAM_43_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_43_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_43_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAM_43_LSDEL_MASK          (0x8000U)
#define PMC_SRAMCTRL1_RAM_43_LSDEL_SHIFT         (15U)
/*! RAM_43_LSDEL - RAM_43 Sleep mode disable. */
#define PMC_SRAMCTRL1_RAM_43_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_43_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAM_43_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_MASK   (0x10000U)
#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_SHIFT  (16U)
/*! RAM_FLASHLPCACHE_LS - Flash Cache RAM Light Sleep mode. */
#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS(x)     (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_SHIFT)) & PMC_SRAMCTRL1_RAM_FLASHLPCACHE_LS_MASK)

#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_DSB_MASK  (0x20000U)
#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_DSB_SHIFT (17U)
/*! RAM_FLASHLPCACHE_DSB - Flash Cache RAM Deep sleep mode. */
#define PMC_SRAMCTRL1_RAM_FLASHLPCACHE_DSB(x)    (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAM_FLASHLPCACHE_DSB_SHIFT)) & PMC_SRAMCTRL1_RAM_FLASHLPCACHE_DSB_MASK)

