nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define SYSCON_I3CFCLKSTCSEL_SEL_MASK            (0x7U)
#define SYSCON_I3CFCLKSTCSEL_SEL_SHIFT           (0U)
/*! SEL - I3C FCLK_STC clock select
 *  0b000..I3CFCLK
 *  0b001..FRO_1M
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3CFCLKSTCSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSTCSEL_SEL_SHIFT)) & SYSCON_I3CFCLKSTCSEL_SEL_MASK)
/*! @} */

/*! @name I3CFCLKSTCDIV - I3C FCLK_STC clock divider */
/*! @{ */

#define SYSCON_I3CFCLKSTCDIV_DIV_MASK            (0x7U)
#define SYSCON_I3CFCLKSTCDIV_DIV_SHIFT           (0U)
/*! DIV - Clock divider value. */
#define SYSCON_I3CFCLKSTCDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSTCDIV_DIV_SHIFT)) & SYSCON_I3CFCLKSTCDIV_DIV_MASK)

#define SYSCON_I3CFCLKSTCDIV_RESET_MASK          (0x20000000U)
#define SYSCON_I3CFCLKSTCDIV_RESET_SHIFT         (29U)
/*! RESET - Resets the divider counter.
 *  0b1..Divider is reset.
 *  0b0..Divider is not reset.
 */
#define SYSCON_I3CFCLKSTCDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSTCDIV_RESET_SHIFT)) & SYSCON_I3CFCLKSTCDIV_RESET_MASK)

#define SYSCON_I3CFCLKSTCDIV_HALT_MASK           (0x40000000U)
#define SYSCON_I3CFCLKSTCDIV_HALT_SHIFT          (30U)
/*! HALT - Halts the divider counter.
 *  0b1..Divider clock is stopped.
 *  0b0..Divider clock is running.
 */
#define SYSCON_I3CFCLKSTCDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSTCDIV_HALT_SHIFT)) & SYSCON_I3CFCLKSTCDIV_HALT_MASK)

#define SYSCON_I3CFCLKSTCDIV_UNSTAB_MASK         (0x80000000U)
#define SYSCON_I3CFCLKSTCDIV_UNSTAB_SHIFT        (31U)
/*! UNSTAB - Divider status flag.
 *  0b1..Clock frequency is not stable.
 *  0b0..Divider clock is stable.
 */
#define SYSCON_I3CFCLKSTCDIV_UNSTAB(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSTCDIV_UNSTAB_SHIFT)) & SYSCON_I3CFCLKSTCDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3CFCLKSDIV - I3C FCLKS clock divider */
/*! @{ */

#define SYSCON_I3CFCLKSDIV_DIV_MASK              (0x7U)
#define SYSCON_I3CFCLKSDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value. */
#define SYSCON_I3CFCLKSDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSDIV_DIV_SHIFT)) & SYSCON_I3CFCLKSDIV_DIV_MASK)

#define SYSCON_I3CFCLKSDIV_RESET_MASK            (0x20000000U)
#define SYSCON_I3CFCLKSDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter.
 *  0b1..Divider is reset.
 *  0b0..Divider is not reset.
 */
#define SYSCON_I3CFCLKSDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSDIV_RESET_SHIFT)) & SYSCON_I3CFCLKSDIV_RESET_MASK)

#define SYSCON_I3CFCLKSDIV_HALT_MASK             (0x40000000U)
#define SYSCON_I3CFCLKSDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter.
 *  0b1..Divider clock is stopped.
 *  0b0..Divider clock is running.
 */
#define SYSCON_I3CFCLKSDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSDIV_HALT_SHIFT)) & SYSCON_I3CFCLKSDIV_HALT_MASK)

#define SYSCON_I3CFCLKSDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_I3CFCLKSDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag.
 *  0b1..Clock frequency is not stable.
 *  0b0..Divider clock is stable.
 */
#define SYSCON_I3CFCLKSDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSDIV_UNSTAB_SHIFT)) & SYSCON_I3CFCLKSDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3CFCLKDIV - I3C FCLK divider */
/*! @{ */

#define SYSCON_I3CFCLKDIV_DIV_MASK               (0x7U)
#define SYSCON_I3CFCLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock divider value. */
#define SYSCON_I3CFCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKDIV_DIV_SHIFT)) & SYSCON_I3CFCLKDIV_DIV_MASK)

#define SYSCON_I3CFCLKDIV_RESET_MASK             (0x20000000U)
#define SYSCON_I3CFCLKDIV_RESET_SHIFT            (29U)
/*! RESET - Resets the divider counter.
 *  0b1..Divider is reset.
 *  0b0..Divider is not reset.
 */
#define SYSCON_I3CFCLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKDIV_RESET_SHIFT)) & SYSCON_I3CFCLKDIV_RESET_MASK)

#define SYSCON_I3CFCLKDIV_HALT_MASK              (0x40000000U)
#define SYSCON_I3CFCLKDIV_HALT_SHIFT             (30U)
/*! HALT - Halts the divider counter.
 *  0b1..Divider clock is stopped.
 *  0b0..Divider clock is running.
 */
#define SYSCON_I3CFCLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKDIV_HALT_SHIFT)) & SYSCON_I3CFCLKDIV_HALT_MASK)

#define SYSCON_I3CFCLKDIV_UNSTAB_MASK            (0x80000000U)
#define SYSCON_I3CFCLKDIV_UNSTAB_SHIFT           (31U)
/*! UNSTAB - Divider status flag.
 *  0b1..Clock frequency is not stable.
 *  0b0..Divider clock is stable.
 */
#define SYSCON_I3CFCLKDIV_UNSTAB(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKDIV_UNSTAB_SHIFT)) & SYSCON_I3CFCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3CFCLKSSEL - I3C FCLK_S selection */
/*! @{ */

#define SYSCON_I3CFCLKSSEL_SEL_MASK              (0x7U)
#define SYSCON_I3CFCLKSSEL_SEL_SHIFT             (0U)
/*! SEL - I3C FCLK_S clock select
 *  0b000..FRO_1M
 *  0b001..No clock
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3CFCLKSSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSSEL_SEL_SHIFT)) & SYSCON_I3CFCLKSSEL_SEL_MASK)
/*! @} */

/*! @name DMICFCLKSEL - DMIC clock selection */
/*! @{ */

#define SYSCON_DMICFCLKSEL_SEL_MASK              (0x7U)
#define SYSCON_DMICFCLKSEL_SEL_SHIFT             (0U)
/*! SEL - DMIC clock select
 *  0b000..Main clock
 *  0b001..PLL0 clock
 *  0b010..Clock in
 *  0b011..FRO_HF
 *  0b100..PLL1 clock
 *  0b101..MCLK in
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_DMICFCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_DMICFCLKSEL_SEL_SHIFT)) & SYSCON_DMICFCLKSEL_SEL_MASK)
/*! @} */

/*! @name DMICFCLKDIV - DMIC clock division */
/*! @{ */

