nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define SYSCON_ELS_FEATURE0_ECSIGN_MASK          (0x300U)
#define SYSCON_ELS_FEATURE0_ECSIGN_SHIFT         (8U)
/*! ECSIGN - Enables ECSIGN command. */
#define SYSCON_ELS_FEATURE0_ECSIGN(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_ECSIGN_SHIFT)) & SYSCON_ELS_FEATURE0_ECSIGN_MASK)

#define SYSCON_ELS_FEATURE0_ECVFY_MASK           (0xC00U)
#define SYSCON_ELS_FEATURE0_ECVFY_SHIFT          (10U)
/*! ECVFY - Enables ECVFY command. */
#define SYSCON_ELS_FEATURE0_ECVFY(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_ECVFY_SHIFT)) & SYSCON_ELS_FEATURE0_ECVFY_MASK)

#define SYSCON_ELS_FEATURE0_ECKXCH_MASK          (0x3000U)
#define SYSCON_ELS_FEATURE0_ECKXCH_SHIFT         (12U)
/*! ECKXCH - Enables ECKXCH command. */
#define SYSCON_ELS_FEATURE0_ECKXCH(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_ECKXCH_SHIFT)) & SYSCON_ELS_FEATURE0_ECKXCH_MASK)

#define SYSCON_ELS_FEATURE0_KEYGEN_MASK          (0x30000U)
#define SYSCON_ELS_FEATURE0_KEYGEN_SHIFT         (16U)
/*! KEYGEN - Enables KEYGEN command. */
#define SYSCON_ELS_FEATURE0_KEYGEN(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_KEYGEN_SHIFT)) & SYSCON_ELS_FEATURE0_KEYGEN_MASK)

#define SYSCON_ELS_FEATURE0_KEYIN_MASK           (0xC0000U)
#define SYSCON_ELS_FEATURE0_KEYIN_SHIFT          (18U)
/*! KEYIN - Enables KEYIN command. */
#define SYSCON_ELS_FEATURE0_KEYIN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_KEYIN_SHIFT)) & SYSCON_ELS_FEATURE0_KEYIN_MASK)

#define SYSCON_ELS_FEATURE0_KEYOUT_MASK          (0x300000U)
#define SYSCON_ELS_FEATURE0_KEYOUT_SHIFT         (20U)
/*! KEYOUT - Enables KEYOUT command. */
#define SYSCON_ELS_FEATURE0_KEYOUT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_KEYOUT_SHIFT)) & SYSCON_ELS_FEATURE0_KEYOUT_MASK)

#define SYSCON_ELS_FEATURE0_KDELETE_MASK         (0xC00000U)
#define SYSCON_ELS_FEATURE0_KDELETE_SHIFT        (22U)
/*! KDELETE - Enables KDELETE command. */
#define SYSCON_ELS_FEATURE0_KDELETE(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_KDELETE_SHIFT)) & SYSCON_ELS_FEATURE0_KDELETE_MASK)
/*! @} */

/*! @name ELS_FEATURE1 - ELS command feature */
/*! @{ */

#define SYSCON_ELS_FEATURE1_CKDF_MASK            (0x3U)
#define SYSCON_ELS_FEATURE1_CKDF_SHIFT           (0U)
/*! CKDF - Enables CKDF command. */
#define SYSCON_ELS_FEATURE1_CKDF(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_CKDF_SHIFT)) & SYSCON_ELS_FEATURE1_CKDF_MASK)

#define SYSCON_ELS_FEATURE1_HKDF_MASK            (0xCU)
#define SYSCON_ELS_FEATURE1_HKDF_SHIFT           (2U)
/*! HKDF - Enables HKDF command. */
#define SYSCON_ELS_FEATURE1_HKDF(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_HKDF_SHIFT)) & SYSCON_ELS_FEATURE1_HKDF_MASK)

#define SYSCON_ELS_FEATURE1_TLS_INIT_MASK        (0x30U)
#define SYSCON_ELS_FEATURE1_TLS_INIT_SHIFT       (4U)
/*! TLS_INIT - Enables TLS_INIT command. */
#define SYSCON_ELS_FEATURE1_TLS_INIT(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_TLS_INIT_SHIFT)) & SYSCON_ELS_FEATURE1_TLS_INIT_MASK)

#define SYSCON_ELS_FEATURE1_HASH_MASK            (0x300U)
#define SYSCON_ELS_FEATURE1_HASH_SHIFT           (8U)
/*! HASH - Enables HASH command. */
#define SYSCON_ELS_FEATURE1_HASH(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_HASH_SHIFT)) & SYSCON_ELS_FEATURE1_HASH_MASK)

#define SYSCON_ELS_FEATURE1_HMAC_MASK            (0xC00U)
#define SYSCON_ELS_FEATURE1_HMAC_SHIFT           (10U)
/*! HMAC - Enables HMAC command. */
#define SYSCON_ELS_FEATURE1_HMAC(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_HMAC_SHIFT)) & SYSCON_ELS_FEATURE1_HMAC_MASK)

#define SYSCON_ELS_FEATURE1_CMAC_MASK            (0x3000U)
#define SYSCON_ELS_FEATURE1_CMAC_SHIFT           (12U)
/*! CMAC - Enables CMAC command. */
#define SYSCON_ELS_FEATURE1_CMAC(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_CMAC_SHIFT)) & SYSCON_ELS_FEATURE1_CMAC_MASK)

#define SYSCON_ELS_FEATURE1_DRBG_REQ_MASK        (0x30000U)
#define SYSCON_ELS_FEATURE1_DRBG_REQ_SHIFT       (16U)
/*! DRBG_REQ - Enables DRBG_REQ command. */
#define SYSCON_ELS_FEATURE1_DRBG_REQ(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DRBG_REQ_SHIFT)) & SYSCON_ELS_FEATURE1_DRBG_REQ_MASK)

#define SYSCON_ELS_FEATURE1_DRBG_TEST_MASK       (0xC0000U)
#define SYSCON_ELS_FEATURE1_DRBG_TEST_SHIFT      (18U)
/*! DRBG_TEST - Enables DRBG_TEST command. */
#define SYSCON_ELS_FEATURE1_DRBG_TEST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DRBG_TEST_SHIFT)) & SYSCON_ELS_FEATURE1_DRBG_TEST_MASK)

#define SYSCON_ELS_FEATURE1_DTRNG_CFG_LOAD_MASK  (0x3000000U)
#define SYSCON_ELS_FEATURE1_DTRNG_CFG_LOAD_SHIFT (24U)
/*! DTRNG_CFG_LOAD - Enables DTRNG_CFG_LOAD command. */
#define SYSCON_ELS_FEATURE1_DTRNG_CFG_LOAD(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DTRNG_CFG_LOAD_SHIFT)) & SYSCON_ELS_FEATURE1_DTRNG_CFG_LOAD_MASK)

#define SYSCON_ELS_FEATURE1_DTRNG_EVAL_MASK      (0xC000000U)
#define SYSCON_ELS_FEATURE1_DTRNG_EVAL_SHIFT     (26U)
/*! DTRNG_EVAL - Enables DTRNG_EVAL command. */
#define SYSCON_ELS_FEATURE1_DTRNG_EVAL(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DTRNG_EVAL_SHIFT)) & SYSCON_ELS_FEATURE1_DTRNG_EVAL_MASK)

#define SYSCON_ELS_FEATURE1_GDET_CFG_LOAD_MASK   (0x30000000U)
#define SYSCON_ELS_FEATURE1_GDET_CFG_LOAD_SHIFT  (28U)
/*! GDET_CFG_LOAD - Enables GDET_CFG_LOAD command. */
#define SYSCON_ELS_FEATURE1_GDET_CFG_LOAD(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_GDET_CFG_LOAD_SHIFT)) & SYSCON_ELS_FEATURE1_GDET_CFG_LOAD_MASK)
/*! @} */

/*! @name ELS_FEATURE0_DP - ELS command feature - duplicate version */
/*! @{ */

#define SYSCON_ELS_FEATURE0_DP_CIPHER_MASK       (0x3U)
#define SYSCON_ELS_FEATURE0_DP_CIPHER_SHIFT      (0U)
/*! CIPHER - Enables CIPHER command. */
#define SYSCON_ELS_FEATURE0_DP_CIPHER(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_CIPHER_SHIFT)) & SYSCON_ELS_FEATURE0_DP_CIPHER_MASK)

#define SYSCON_ELS_FEATURE0_DP_AUTH_CIPHER_MASK  (0xCU)
#define SYSCON_ELS_FEATURE0_DP_AUTH_CIPHER_SHIFT (2U)
/*! AUTH_CIPHER - Enables AUTH_CIPHER command. */
#define SYSCON_ELS_FEATURE0_DP_AUTH_CIPHER(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_AUTH_CIPHER_SHIFT)) & SYSCON_ELS_FEATURE0_DP_AUTH_CIPHER_MASK)

#define SYSCON_ELS_FEATURE0_DP_ECSIGN_MASK       (0x300U)
#define SYSCON_ELS_FEATURE0_DP_ECSIGN_SHIFT      (8U)
/*! ECSIGN - Enables ECSIGN command. */
#define SYSCON_ELS_FEATURE0_DP_ECSIGN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_ECSIGN_SHIFT)) & SYSCON_ELS_FEATURE0_DP_ECSIGN_MASK)

#define SYSCON_ELS_FEATURE0_DP_ECVFY_MASK        (0xC00U)
#define SYSCON_ELS_FEATURE0_DP_ECVFY_SHIFT       (10U)
/*! ECVFY - Enables ECSIGN command. */
#define SYSCON_ELS_FEATURE0_DP_ECVFY(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_ECVFY_SHIFT)) & SYSCON_ELS_FEATURE0_DP_ECVFY_MASK)

#define SYSCON_ELS_FEATURE0_DP_ECKXCH_MASK       (0x3000U)
#define SYSCON_ELS_FEATURE0_DP_ECKXCH_SHIFT      (12U)
/*! ECKXCH - Enables ECSIGN command. */
#define SYSCON_ELS_FEATURE0_DP_ECKXCH(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_ECKXCH_SHIFT)) & SYSCON_ELS_FEATURE0_DP_ECKXCH_MASK)

#define SYSCON_ELS_FEATURE0_DP_KEYGEN_MASK       (0x30000U)
#define SYSCON_ELS_FEATURE0_DP_KEYGEN_SHIFT      (16U)
/*! KEYGEN - Enables KEYGEN command. */
#define SYSCON_ELS_FEATURE0_DP_KEYGEN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_KEYGEN_SHIFT)) & SYSCON_ELS_FEATURE0_DP_KEYGEN_MASK)

#define SYSCON_ELS_FEATURE0_DP_KEYIN_MASK        (0xC0000U)
#define SYSCON_ELS_FEATURE0_DP_KEYIN_SHIFT       (18U)
/*! KEYIN - Enables KEYIN command. */
#define SYSCON_ELS_FEATURE0_DP_KEYIN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_KEYIN_SHIFT)) & SYSCON_ELS_FEATURE0_DP_KEYIN_MASK)

#define SYSCON_ELS_FEATURE0_DP_KEYOUT_MASK       (0x300000U)
#define SYSCON_ELS_FEATURE0_DP_KEYOUT_SHIFT      (20U)
/*! KEYOUT - Enables KEYOUT command. */
#define SYSCON_ELS_FEATURE0_DP_KEYOUT(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_KEYOUT_SHIFT)) & SYSCON_ELS_FEATURE0_DP_KEYOUT_MASK)

