nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define SYSCON_ELS_FEATURE0_DP_KDELETE_MASK      (0xC00000U)
#define SYSCON_ELS_FEATURE0_DP_KDELETE_SHIFT     (22U)
/*! KDELETE - Enables KDELETE command. */
#define SYSCON_ELS_FEATURE0_DP_KDELETE(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE0_DP_KDELETE_SHIFT)) & SYSCON_ELS_FEATURE0_DP_KDELETE_MASK)
/*! @} */

/*! @name ELS_FEATURE1_DP - ELS command feature - duplicate version */
/*! @{ */

#define SYSCON_ELS_FEATURE1_DP_CKDF_MASK         (0x3U)
#define SYSCON_ELS_FEATURE1_DP_CKDF_SHIFT        (0U)
/*! CKDF - Enables CKDF command. */
#define SYSCON_ELS_FEATURE1_DP_CKDF(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_CKDF_SHIFT)) & SYSCON_ELS_FEATURE1_DP_CKDF_MASK)

#define SYSCON_ELS_FEATURE1_DP_HKDF_MASK         (0xCU)
#define SYSCON_ELS_FEATURE1_DP_HKDF_SHIFT        (2U)
/*! HKDF - Enables HKDF command. */
#define SYSCON_ELS_FEATURE1_DP_HKDF(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_HKDF_SHIFT)) & SYSCON_ELS_FEATURE1_DP_HKDF_MASK)

#define SYSCON_ELS_FEATURE1_DP_TLS_INIT_MASK     (0x30U)
#define SYSCON_ELS_FEATURE1_DP_TLS_INIT_SHIFT    (4U)
/*! TLS_INIT - Enables TLS_INIT command. */
#define SYSCON_ELS_FEATURE1_DP_TLS_INIT(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_TLS_INIT_SHIFT)) & SYSCON_ELS_FEATURE1_DP_TLS_INIT_MASK)

#define SYSCON_ELS_FEATURE1_DP_HASH_MASK         (0x300U)
#define SYSCON_ELS_FEATURE1_DP_HASH_SHIFT        (8U)
/*! HASH - Enables HASH command. */
#define SYSCON_ELS_FEATURE1_DP_HASH(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_HASH_SHIFT)) & SYSCON_ELS_FEATURE1_DP_HASH_MASK)

#define SYSCON_ELS_FEATURE1_DP_HMAC_MASK         (0xC00U)
#define SYSCON_ELS_FEATURE1_DP_HMAC_SHIFT        (10U)
/*! HMAC - Enables HMAC command. */
#define SYSCON_ELS_FEATURE1_DP_HMAC(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_HMAC_SHIFT)) & SYSCON_ELS_FEATURE1_DP_HMAC_MASK)

#define SYSCON_ELS_FEATURE1_DP_CMAC_MASK         (0x3000U)
#define SYSCON_ELS_FEATURE1_DP_CMAC_SHIFT        (12U)
/*! CMAC - Enables CMAC command. */
#define SYSCON_ELS_FEATURE1_DP_CMAC(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_CMAC_SHIFT)) & SYSCON_ELS_FEATURE1_DP_CMAC_MASK)

#define SYSCON_ELS_FEATURE1_DP_DRBG_REQ_MASK     (0x30000U)
#define SYSCON_ELS_FEATURE1_DP_DRBG_REQ_SHIFT    (16U)
/*! DRBG_REQ - Enables DRBG_REQ command. */
#define SYSCON_ELS_FEATURE1_DP_DRBG_REQ(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_DRBG_REQ_SHIFT)) & SYSCON_ELS_FEATURE1_DP_DRBG_REQ_MASK)

#define SYSCON_ELS_FEATURE1_DP_DRBG_TEST_MASK    (0xC0000U)
#define SYSCON_ELS_FEATURE1_DP_DRBG_TEST_SHIFT   (18U)
/*! DRBG_TEST - Enables DRBG_TEST command. */
#define SYSCON_ELS_FEATURE1_DP_DRBG_TEST(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_DRBG_TEST_SHIFT)) & SYSCON_ELS_FEATURE1_DP_DRBG_TEST_MASK)

#define SYSCON_ELS_FEATURE1_DP_DTRNG_CFG_LOAD_MASK (0x3000000U)
#define SYSCON_ELS_FEATURE1_DP_DTRNG_CFG_LOAD_SHIFT (24U)
/*! DTRNG_CFG_LOAD - Enables DTRNG_CFG_LOAD command. */
#define SYSCON_ELS_FEATURE1_DP_DTRNG_CFG_LOAD(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_DTRNG_CFG_LOAD_SHIFT)) & SYSCON_ELS_FEATURE1_DP_DTRNG_CFG_LOAD_MASK)

#define SYSCON_ELS_FEATURE1_DP_DTRNG_EVAL_MASK   (0xC000000U)
#define SYSCON_ELS_FEATURE1_DP_DTRNG_EVAL_SHIFT  (26U)
/*! DTRNG_EVAL - Enables DTRNG_EVAL command. */
#define SYSCON_ELS_FEATURE1_DP_DTRNG_EVAL(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_DTRNG_EVAL_SHIFT)) & SYSCON_ELS_FEATURE1_DP_DTRNG_EVAL_MASK)

#define SYSCON_ELS_FEATURE1_DP_GDET_CFG_LOAD_MASK (0x30000000U)
#define SYSCON_ELS_FEATURE1_DP_GDET_CFG_LOAD_SHIFT (28U)
/*! GDET_CFG_LOAD - Enables GDET_CFG_LOAD command. */
#define SYSCON_ELS_FEATURE1_DP_GDET_CFG_LOAD(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_FEATURE1_DP_GDET_CFG_LOAD_SHIFT)) & SYSCON_ELS_FEATURE1_DP_GDET_CFG_LOAD_MASK)
/*! @} */

/*! @name ELS_BOOT_RETRY_CNT - ELS boot retry counter */
/*! @{ */

#define SYSCON_ELS_BOOT_RETRY_CNT_BOOT_RETRY_CNT_MASK (0xFFFFFFFFU)
#define SYSCON_ELS_BOOT_RETRY_CNT_BOOT_RETRY_CNT_SHIFT (0U)
/*! BOOT_RETRY_CNT - Boot retry counter bit. */
#define SYSCON_ELS_BOOT_RETRY_CNT_BOOT_RETRY_CNT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_BOOT_RETRY_CNT_BOOT_RETRY_CNT_SHIFT)) & SYSCON_ELS_BOOT_RETRY_CNT_BOOT_RETRY_CNT_MASK)
/*! @} */

/*! @name ELS_CLK_CTRL - ELS clock control */
/*! @{ */

#define SYSCON_ELS_CLK_CTRL_GDET_REFCLK_EN_MASK  (0x1U)
#define SYSCON_ELS_CLK_CTRL_GDET_REFCLK_EN_SHIFT (0U)
/*! GDET_REFCLK_EN - GDET reference clock enable bit. */
#define SYSCON_ELS_CLK_CTRL_GDET_REFCLK_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_GDET_REFCLK_EN_SHIFT)) & SYSCON_ELS_CLK_CTRL_GDET_REFCLK_EN_MASK)

#define SYSCON_ELS_CLK_CTRL_DTRNG_REFCLK_EN_MASK (0x2U)
#define SYSCON_ELS_CLK_CTRL_DTRNG_REFCLK_EN_SHIFT (1U)
/*! DTRNG_REFCLK_EN - DTRNG reference clock enable bit. */
#define SYSCON_ELS_CLK_CTRL_DTRNG_REFCLK_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_DTRNG_REFCLK_EN_SHIFT)) & SYSCON_ELS_CLK_CTRL_DTRNG_REFCLK_EN_MASK)
/*! @} */

/*! @name ELS_CLK_CTRL_SET - ELS clock control set */
/*! @{ */

#define SYSCON_ELS_CLK_CTRL_SET_GDET_REFCLK_EN_SET_MASK (0x1U)
#define SYSCON_ELS_CLK_CTRL_SET_GDET_REFCLK_EN_SET_SHIFT (0U)
/*! GDET_REFCLK_EN_SET - GDET reference clock enable set bit. */
#define SYSCON_ELS_CLK_CTRL_SET_GDET_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_SET_GDET_REFCLK_EN_SET_SHIFT)) & SYSCON_ELS_CLK_CTRL_SET_GDET_REFCLK_EN_SET_MASK)

#define SYSCON_ELS_CLK_CTRL_SET_DTRNG_REFCLK_EN_SET_MASK (0x2U)
#define SYSCON_ELS_CLK_CTRL_SET_DTRNG_REFCLK_EN_SET_SHIFT (1U)
/*! DTRNG_REFCLK_EN_SET - DTRNG reference clock enable set bit. */
#define SYSCON_ELS_CLK_CTRL_SET_DTRNG_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_SET_DTRNG_REFCLK_EN_SET_SHIFT)) & SYSCON_ELS_CLK_CTRL_SET_DTRNG_REFCLK_EN_SET_MASK)
/*! @} */

/*! @name ELS_CLK_CTRL_CLR - ELS clock control clear */
/*! @{ */

#define SYSCON_ELS_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_MASK (0x1U)
#define SYSCON_ELS_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_SHIFT (0U)
/*! GDET_REFCLK_EN_CLR - GDET reference clock enable clear bit. */
#define SYSCON_ELS_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_SHIFT)) & SYSCON_ELS_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_MASK)

#define SYSCON_ELS_CLK_CTRL_CLR_DTRNG_REFCLK_EN_CLR_MASK (0x2U)
#define SYSCON_ELS_CLK_CTRL_CLR_DTRNG_REFCLK_EN_CLR_SHIFT (1U)
/*! DTRNG_REFCLK_EN_CLR - DTRNG reference clock enable clear bit. */
#define SYSCON_ELS_CLK_CTRL_CLR_DTRNG_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_CTRL_CLR_DTRNG_REFCLK_EN_CLR_SHIFT)) & SYSCON_ELS_CLK_CTRL_CLR_DTRNG_REFCLK_EN_CLR_MASK)
/*! @} */

/*! @name ELS_CLK_SEL - ELS clock select */
/*! @{ */

#define SYSCON_ELS_CLK_SEL_GDET_REFCLK_SEL_MASK  (0x3U)
#define SYSCON_ELS_CLK_SEL_GDET_REFCLK_SEL_SHIFT (0U)
/*! GDET_REFCLK_SEL - GDET reference clock select bit. */
#define SYSCON_ELS_CLK_SEL_GDET_REFCLK_SEL(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_ELS_CLK_SEL_GDET_REFCLK_SEL_SHIFT)) & SYSCON_ELS_CLK_SEL_GDET_REFCLK_SEL_MASK)
/*! @} */

/*! @name ELS_AS_CFG0 - ELS AS configuration */
/*! @{ */

