nxp-mcuxpresso/mcux-sdk/devices/LPC5534/LPC5534.h
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM03_MASK (0x10U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM03_SHIFT (4U)
/*! ENABLE_RAM03 - Enable RAM03 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM03(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM03_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM03_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_MBIT_MASK (0x20U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_MBIT_SHIFT (5U)
/*! ENABLE_RAM1_MBIT - Enable RAM1 ECC mbit error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_MBIT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_MBIT_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_MBIT_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_SBIT_MASK (0x40U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_SBIT_SHIFT (6U)
/*! ENABLE_RAM1_SBIT - Enable RAM1 ECC sbit error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_SBIT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_SBIT_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM1_SBIT_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM2_MASK (0x80U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM2_SHIFT (7U)
/*! ENABLE_RAM2 - Enable RAM2 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM2_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM2_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM3_MASK (0x100U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM3_SHIFT (8U)
/*! ENABLE_RAM3 - Enable RAM3 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM3(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM3_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM3_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM40_MASK (0x200U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM40_SHIFT (9U)
/*! ENABLE_RAM40 - Enable RAM40 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM40(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM40_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM40_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM41_MASK (0x400U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM41_SHIFT (10U)
/*! ENABLE_RAM41 - Enable RAM41 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM41(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM41_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM41_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM42_MASK (0x800U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM42_SHIFT (11U)
/*! ENABLE_RAM42 - Enable RAM42 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM42(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM42_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM42_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM43_MASK (0x1000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM43_SHIFT (12U)
/*! ENABLE_RAM43 - Enable RAM43 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM43(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM43_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM43_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAMX_PARITY_ERROR_INTEN_MASK (0x100000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAMX_PARITY_ERROR_INTEN_SHIFT (20U)
/*! RAMX_PARITY_ERROR_INTEN - Interrupt enable for RAMX parity error
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAMX parity error status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAMX_PARITY_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAMX_PARITY_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAMX_PARITY_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM0_PARITY_ERROR_INTEN_MASK (0x200000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM0_PARITY_ERROR_INTEN_SHIFT (21U)
/*! RAM0_PARITY_ERROR_INTEN - Interrupt enable for RAM0 parity error
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM0 parity error status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM0_PARITY_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM0_PARITY_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM0_PARITY_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_MBIT_ERROR_INTEN_MASK (0x400000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_MBIT_ERROR_INTEN_SHIFT (22U)
/*! RAM1_ECC_MBIT_ERROR_INTEN - Interrupt enable for RAM1 ECC mbit_err
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM1 ECC mbit_err status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_MBIT_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_MBIT_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_MBIT_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_SBIT_ERROR_INTEN_MASK (0x800000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_SBIT_ERROR_INTEN_SHIFT (23U)
/*! RAM1_ECC_SBIT_ERROR_INTEN - Interrupt enable for RAM1 ECC sbit_err
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM1 ECC sbit_err status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_SBIT_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_SBIT_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM1_ECC_SBIT_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM2_PARITY_ERROR_INTEN_MASK (0x1000000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM2_PARITY_ERROR_INTEN_SHIFT (24U)
/*! RAM2_PARITY_ERROR_INTEN - Interrupt enable for RAM2 parity error
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM2 parity error status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM2_PARITY_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM2_PARITY_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM2_PARITY_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM3_PARITY_ERROR_INTEN_MASK (0x2000000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM3_PARITY_ERROR_INTEN_SHIFT (25U)
/*! RAM3_PARITY_ERROR_INTEN - Interrupt enable for RAM3 parity error
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM3 parity error status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM3_PARITY_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM3_PARITY_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM3_PARITY_ERROR_INTEN_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM4_PARITY_ERROR_INTEN_MASK (0x4000000U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM4_PARITY_ERROR_INTEN_SHIFT (26U)
/*! RAM4_PARITY_ERROR_INTEN - Interrupt enable for RAM4 parity error
 *  0b0..Disable.
 *  0b1..Enable RAM error interrupt when RAM4 parity error status flag is set.
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM4_PARITY_ERROR_INTEN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM4_PARITY_ERROR_INTEN_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_RAM4_PARITY_ERROR_INTEN_MASK)
/*! @} */

/*! @name MEM_PARITY_ECC_ERROR_FLAG - Memory parity ECC error flag */
/*! @{ */

